<template>
    <div class="page">
        <div class="container">
            <nav>
                <router-link class="custon-nav-link" to="/">Главная</router-link>
                <router-link class="custon-nav-link" to="/science/">Статья к Публикации</router-link>
                <router-link class="custon-nav-link" to="/abstract">Автореферат</router-link>
                <router-link class="custon-nav-link" to="/chapter1">Глава 1</router-link>
                <router-link class="custon-nav-link" to="/chapter2">Глава 2</router-link>
                <router-link class="custon-nav-link" to="/chapter3">Глава 3</router-link>
                <router-link class="custon-nav-link" to="/chapter4">Глава 4</router-link>
            </nav>
            <router-view />
        </div>
        <div class="container">
            <h1>
                Методы оптимизации процесса производства документов аэронавигационной информации на основе
                моделирования СМО с помощью языка программирования Golang
            </h1>

            <h2>
                Аннотация
            </h2>
            <p>
                В этой статье представлена методология оптимизации процесса производства документов аэронавигационной
                информации, базирующаяся на моделировании Системы Массового Обслуживания (далее СМО). Рассмотрены
                многофазные системы массового обслуживания, как базис для изучаемых процессов. Язык программирования
                Golang и параллельные вычисления в данном исследовании выступают как основные инструменты для
                реализации имитационных моделей. Предоставляется программный код и результаты стохастического
                моделирования.
            </p>

            <h2>
                1. Моделирование случайных величин и распределений на языке <b>Golang</b>
            </h2>
            <p>
                Рассмотрим простейшие модели на примере подбрасывали одного и нескольких кубиков для игры в кости.
                Эти модели затронут вероятностные распределения, а также инструментарий параллельных вычислений для
                моделирования.
            </p>

            <h3>
                1.1. Модель подбрасывания одного кубика
            </h3>
            <p>
                Программный код модели представлен на листинге 1.
                Результат моделирования представлен представлен на рисунке 1.
            </p>
            <div class="bar-place">
                <Bar v-bind:data="[0, 21, 22, 23, 20, 18, 17]" v-bind:labels="['0', '1', '2', '3', '4', '5', '6']"/>
            </div>

            <h3>
                1.2. Модель подбрасывания двух кубиков
            </h3>
            <p>
                Программный код модели представлен на листинге 2.
                Результат моделирования представлен представлен на рисунке 2.
            </p>
            <div class="bar-place">
                <Bar v-bind:data="[0, 0, 10, 20, 30, 40, 50, 55, 50, 35, 23, 18, 6]"
                     v-bind:labels="['0', '1', '2', '3', '4', '5', '6', '7', '8', '9', '10', '11', '12']"/>
            </div>

            <h3>
                1.3. Модель нормального распределения
            </h3>
            <p>
                Программный код модели представлен на листинге 3.
                Результат моделирования представлен представлен на рисунке 3.
            </p>
            <div class="bar-place">
                <Bar v-bind:data="[0, 0, 6, 18, 33, 44, 49, 51, 50, 37, 21, 20, 8]"
                     v-bind:labels="['0', '1', '2', '3', '4', '5', '6', '7', '8', '9', '10', '11', '12']"/>
            </div>

            <h3>
                1.4. Модель экспоненциального распределения
            </h3>
            <p>
                Программный код модели представлен на листинге 4.
                Результат моделирования представлен представлен на рисунке 4.
            </p>
            <div class="bar-place">
                <Bar v-bind:data="[0, 160, 80, 60, 62, 40, 25, 10, 12, 9, 8, 2, 4]"
                     v-bind:labels="['0', '.05', '.1', '.15', '.2', '.25', '.3', '.35', '.4', '.45', '.5', '.55', '.6']"/>
            </div>

            <h3>
                1.5. Стохастическое моделирование
            </h3>
            <p>
                Метод Монте-Карло и СМО М/М/1 [расписать подробнее]
            </p>
            <p>
                Программный код модели представлен на листинге 5.
                Результат моделирования представлен представлен на рисунке 5.
            </p>
            <div class="bar-place">
                <Bar v-bind:data="[0, 0.0004, 0.0006, 0.004, 0.010, 0.016, 0.012, 0.002, 0.0006, 0.0001, 0]"
                     v-bind:labels="['550', '600', '625', '650', '675', '700', '725', '750', '775', '800', '825']"/>
            </div>


            <h2>
                2. Метод оптимизации процесса производства документов аэронавигационной информации на основе
                моделирования многофазной системы массового обслуживания упрощенной схемы циркуляции аэронавигационных документов
                между ЦАИ и региональными САИ.
            </h2>
            <p>
                Информации по СМО полно читать там [ссылки]. Почему многофазные? Описать точки соприкосновения
                текущей системы аэронавигационной информации с моделируемыми СМО КРАТКО
            </p>

            <h3>
                2.1. Модель расширенного нормального распределения с помощью горутин
            </h3>
            <p>
                Метод Монте-Карло и СМО М/М/1 [расписать подробнее]. Задача: нормальное распределение со следующими
                характеристиками: кубиков: 200 штук, число попыток: 150000 попыток. Основная идея - использование
                <b>горутин</b>. Программный код модели представлен на листинге 6. Результат моделирования представлен
                представлен на рисунке 6.
            </p>

            <h3>
                2.2. Имитационная модель упрощённой схемы циркуляции аэронавигационных документов между ЦАИ и
                региональными САИ
            </h3>
            <p>
                Описание имитационной модели.
            </p>

            <h3>
                2.3. Статистическая модель упущенной схемы циркуляции аэронавигационных документов между ЦАИ и
                региональными САИ
            </h3>
            <p>
                Описание статистической модели.
            </p>

            <p>
                Статья окончена.
                <br>
                В следующей статье можно представить исследование имитационной модели многофазной системы массового
                обслуживания приближенной к реальной схемы циркуляции АНИ
            </p>
        </div>
    </div>
</template>

<script>
  import Bar from './components/BarChart'

  export default {
    name: 'Science',
    components: {
      Bar,
    }
  }
</script>

<style scoped>
    .page {
        position: absolute;
        width: 100%;
        left: 0;
        top: 0;
        color: #35495e;
    }

    .container {
        width: 1280px;
        margin: 0 auto 0 auto;
    }

    .bar-place {
        width: 450px;
        margin: 50px auto 50px auto;
    }

    h1 {
        margin: 25px 0;
        font-family: "Ubuntu", sans-serif;
        color: #35495e;
        font-weight: 400;
        font-size: 24px;
        line-height: 36px;
    }

    h2 {
        font-family: "Ubuntu", sans-serif;
        color: #35495e;
        margin: 5px 0 25px 0;
        font-weight: 400;
        font-size: 22px;
        text-transform: none;
    }

    h3 {
        font-family: "Ubuntu", sans-serif;
        color: #35495e;
        margin: 5px 0 15px 0;
        font-weight: 400;
        font-size: 20px;
        text-transform: none;
    }

    p {
        font-family: "Ubuntu", sans-serif;
        font-size: 16px;
        line-height: 28px;
        margin-bottom: 25px;
    }

    nav {
        margin-top: 20px;
        font-size: 16px;
    }

    .custon-nav-link {
        padding-right: 30px;
        display: inline-block;
    }
</style>
